OdUnitsFormatter
For internal use only.

OdUnitsFormatter.unformatA_unnorm(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Converts string to angular value using specified formatting settings
without normalizing it to [0, 2*Pi] range.
\returns specified string as an angular value.
\param string [in]  String to unformat.
\param refuseDots [in]  Specifies whether to refuse having dots in formatted value.
\remarks
All angles are expressed as radians.

OdUnitsFormatter.unformatA(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Converts string to angular value using specified formatting settings.
\returns specified string as an angular value.
\param string [in]  String to unformat.
\remarks
All angles are expressed as radians.

OdUnitsFormatter.formatA_unnorm(System.Double,OdUnitsFormatter.AUnits,System.Int32,System.Int32,System.Int32,System.UInt16!System.Runtime.CompilerServices.IsConst*)
\details
Converts angular value to string using specified formatting settings
without normalizing it to [0, 2*Pi] range.
\returns the specified angular value as a string.
\param value [in]  Value to format.
\param aUnits [in]  Angle units.
\param precision [in]  Number of decimal places.
\param dimazin [in]  A combination of ZeroSuppressionFlags from OdDbDatabase variable dimazin.
\param unitMode [in]  UNITMODE value.
\param decsep [in]  Decimal separator.
\remarks
* A zero value for decsep specifies the default separator is to be used.
\remarks
All angles are expressed as radians.

OdUnitsFormatter.formatA(System.Double,OdUnitsFormatter.AUnits,System.Int32,System.Int32,System.Int32,System.UInt16!System.Runtime.CompilerServices.IsConst*)
\details
Converts angular value to string using specified formatting settings.
\returns specified angular value as a string.
\param value [in]  Value to format.
\param aUnits [in]  Angle units.
\param precision [in]  Number of decimal places.
\param dimazin [in]  A combination of ZeroSuppressionFlags from OdDbDatabase variable dimazin.
\param unitMode [in]  UNITMODE value.
\param decsep [in]  Decimal separator.
\remarks
* A zero value for decsep specifies the default separator is to be used.
\remarks
All angles are expressed as radians.

OdUnitsFormatter.unformatL(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the specified length string as a length value.
\param string [in]  String to unformat.

OdUnitsFormatter.formatArea(System.Double,OdUnitsFormatter.LUnits,System.Int32,System.Int32,System.Int32,System.UInt16!System.Runtime.CompilerServices.IsConst*,System.UInt16!System.Runtime.CompilerServices.IsConst*)
\details
Converts area value to string using specified formatting settings.
\returns specified area value as a string.
\param value [in]  Value to format.
\param lUnits [in]  Length units.
\param precision [in]  Number of decimal places.
\param dimzin [in]  A combination of ZeroSuppressionFlags.
\param unitMode [in]  UNITMODE value.
\param decsep [in]  Decimal separator.
\param thsep [in]  Thousands separator.
\remarks
* A zero value for decsep specifies the default separator is to be used.
* A zero value for thsep specifies that no separator is to be used.

OdUnitsFormatter.formatL(System.Double,OdUnitsFormatter.LUnits,System.Int32,System.Int32,System.Int32,System.UInt16!System.Runtime.CompilerServices.IsConst*,System.UInt16!System.Runtime.CompilerServices.IsConst*,System.Boolean)
\details
Converts linear value to string using specified formatting settings.
\returns specified linear value as a string.
\param value [in]  Value to format.
\param lUnits [in]  Length units.
\param precision [in]  Number of decimal places.
\param dimzin [in]  A combination of ZeroSuppressionFlags.
\param unitMode [in]  UNITMODE value.
\param decsep [in]  Decimal separator.
\param thsep [in]  Thousands separator.
\param useStdRound [in]  Usage of std::round.
\remarks
* A zero value for decsep specifies the default separator is to be used.
* A zero value for thsep specifies that no separator is to be used.
* A true value for useStdRound specifies that std::round will be used in decimal value rounding.
This means that rounding starts from 5, otherwise it starts from 5 + 1e-15.

OdUnitsFormatter.isZeroInchesSuppressed2(System.Int32)
\details
Checks if dimzin value specifies zero inch suppression.
\returns true if the specified dimzin values contains kIncludesZeroFeetAndSuppressesZeroInches flag.
\param dimzin [in]  Value to check.

OdUnitsFormatter.isZeroFeetSuppressed2(System.Int32)
\details
Checks if dimzin value specifies zero feet suppression.
\returns true if the specified dimzin values contains kIncludesZeroFeetAndPreciselyZeroInches flag.
\param dimzin [in]  Value to check.

OdUnitsFormatter.isZeroInchesSuppressed(System.Int32)
\details
Checks if dimzin value specifies zero inch suppression.
\returns true if the specified dimzin values contains kIncludesZeroFeetAndSuppressesZeroInches flag.
\param dimzin [in]  Value to check.

OdUnitsFormatter.isZeroFeetSuppressed(System.Int32)
\details
Checks if dimzin value specifies zero feet suppression.
\returns true if the specified dimzin values contains kIncludesZeroFeetAndPreciselyZeroInches flag.
\param dimzin [in]  Value to check.

OdUnitsFormatter.unformatAngle(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the specified string as an angle value.
\param string [in]  String to unformat.
\remarks
The returned value depends on the ANGBASE system variable.
\remarks
All angles are expressed in radians.

OdUnitsFormatter.formatAngle(System.Double)
\details
Returns the specified angle value as a string.
\param value [in]  Value to format.
\remarks
The returned value depends on the ANGBASE, AUNITS, AUPREC, DIMAZIN, and UNITMODE system variables.
\remarks
All angles are expressed in radians.

OdUnitsFormatter.unformatLinear(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the specified string as a distance value.
\param string [in]  String to unformat.
\remarks
The returned value depends on the UNITMODE system variable.

OdUnitsFormatter.formatLinear(System.Double)
\details
Returns the specified distance value as a string.
\param value [in]  Value to format.
\remarks
The returned value depends on the DIMZIN, LUNITS, LUPREC, and UNITMODE system variables.

OdUnitsFormatter.unformatCmColor(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the specified string as an wrapped OdCmColorBase object.
\param string [in]  String to unformat.

OdUnitsFormatter.formatCmColor(OdCmColorBase!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the specified color value or OdCmColorBase object as a string.
\param value [in]  Value to format.